0/k
/*----------------------------------------------------------------------------------*\
|                                                                                    | 
|    ANSA_VERSION: 14.0.0                                                            | 
|                                                                                    | 
|    file created by  A N S A  Mon Aug 15 14:28:13 2016                              | 
|                                                                                    | 
|    Output from: D:/work/N304-UAZ-reductor/cae-of/Untitled                          | 
|                                                                                    | 
\*----------------------------------------------------------------------------------*/



FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;


boundaryField
{
	"wall-body.3_importedbody|wall-body.3_importedbody1|wall-body.3_importedbody2"
	{
		type            kqRWallFunction;
		value           $internalField;
	}

	"if_tube1_out_sharnir1_in|if_tube2_in_sharnir1_out|if_sharnir1_out_tube2_in|if_sharnir1_in_tube1_out"
	{
		type            cyclicAMI;
		value           $internalField;
	}
	tube1_in
	{
		type            kqRWallFunction;
		value           $internalField;
	}
	
	tube2_out
	{
		type            kqRWallFunction;
		value           $internalField;
	}

}
